Chinese_name_poker = {'10C': "梅花10", '10D': "方块10", '10H': "红桃10", '10S': "黑桃10",
                      '2C': "梅花2", '2D': "方块2", '2H': "红桃2", '2S': "黑桃2",
                      '3C': "梅花3", '3D': "方块3", '3H': "红桃3", '3S': "黑桃3",
                      '4C': "梅花4", '4D': "方块4", '4H': "红桃4", '4S': "黑桃4",
                      '5C': "梅花5", '5D': "方块5", '5H': "红桃5", '5S': "黑桃5",
                      '6C': "梅花6", '6D': "方块6", '6H': "红桃6", '6S': "黑桃6",
                      '7C': "梅花7", '7D': "方块7", '7H': "红桃7", '7S': "黑桃7",
                      '8C': "梅花8", '8D': "方块8", '8H': "红桃8", '8S': "黑桃8",
                      '9C': "梅花9", '9D': "方块9", '9H': "红桃9", '9S': "黑桃9",
                      'AC': "梅花A", 'AD': "方块A", 'AH': "红桃A", 'AS': "黑桃A",
                      'JC': "梅花J", 'JD': "方块J", 'JH': "红桃J", 'JS': "黑桃J",
                      'KC': "梅花K", 'KD': "方块K", 'KH': "红桃K", 'KS': "黑桃K",
                      'QC': "梅花Q", 'QD': "方块Q", 'QH': "红桃Q", 'QS': "黑桃Q"}

